configuration/src/InformationRegisters/ProcessesToStart/ProcessesToStart.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProcessesToStart</name>
  <resources>
    <name>DeferredStartDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>State</name>
    <type>
      <types>EnumRef.ProcessesStatesForStart</types>
    </type>
  </resources>
  <attributes>
    <name>StartCancelReason</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Owner</name>
    <type>
      <types>DefinedType.DeferredBusinessProcess</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ProcessesStatesForStart/ProcessesStatesForStart.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProcessesStatesForStart</name>
  <enumValues>
    <name>ReadyToStart</name>
  </enumValues>
  <enumValues>
    <name>StartCanceled</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/ProcessesToStart/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Adds information about successful process start.
//
// Parameters:
//   - 
//
Procedure RegisterProcessStart(Process_) Export
	
	Record = CreateRecordManager();
	Record.Owner = Process_;
	Record.Read();
	
	If Not Record.Selected() Then
		Return;
	EndIf;
	
	Record.Delete();
	
EndProcedure

// Adds information about process start cancellation.
//
// Parameters:
//   - 
//
Procedure RegisterStartCancellation(Process_, CancellationReason) Export
	
	Record = CreateRecordManager();
	Record.Owner = Process_;
	Record.Read();
	
	If Not Record.Selected() Then
		Return;
	EndIf;
	
	Record.State = Enums.ProcessesStatesForStart.StartCanceled;
	Record.StartCancelReason = CancellationReason;
	
	Record.Write();
	
EndProcedure

#EndRegion

#EndIf
